In [1]:
import pandas as pd

In [2]:
data = ['a','b','c']
se = pd.Series(data)
se

0    a
1    b
2    c
dtype: object

In [3]:
se.index

RangeIndex(start=0, stop=3, step=1)

In [4]:
se.values

array(['a', 'b', 'c'], dtype=object)

In [5]:
print(se[1])
print(se[2])

b
c

In [7]:
print(se[:2])
print(se[:])

0    a
1    b
dtype: object
0    a
1    b
2    c
dtype: object

In [8]:
se.name = 'alphabet'
se

0    a
1    b
2    c
Name: alphabet, dtype: object

In [9]:
se.index.name = 'No.'
se

No.
0    a
1    b
2    c
Name: alphabet, dtype: object

In [13]:
data = ['a','b','c','d']
se = pd.Series(data, index=['A','B','C','D'])
print(se)
print(se['A'])

A    a
B    b
C    c
D    d
dtype: object
a

In [14]:
se.index=[1,2,3,4]
print(se)

1    a
2    b
3    c
4    d
dtype: object

In [17]:
import numpy as np

data = np.array([[1,2,3],[4,5,6],[7,8,9]])
column = ['D','E','F']

df = pd.DataFrame(data=data, index = ['A','B','C'], columns=column)

df

   D  E  F
A  1  2  3
B  4  5  6
C  7  8  9

In [18]:
data = {
    'country' : ['kor','usa','china','japan'],
    'rank' : [1,2,3,4],
    'grade' : ['A','B','C','D']
}

df = pd.DataFrame(data)
df

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C
3   japan     4     D

In [25]:
df = df.set_index('grade')
df

      country  rank
grade
A         kor     1
B         usa     2
C       china     3
D       japan     4

In [26]:
data = {
    'country' : ['kor','usa','china','japan'],
    'rank' : [1,2,3,4],
    'grade' : ['A','B','C','D']
}

df = pd.DataFrame(data)
df

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C
3   japan     4     D

In [27]:
df.country

0      kor
1      usa
2    china
3    japan
Name: country, dtype: object

In [28]:
df['country']

0      kor
1      usa
2    china
3    japan
Name: country, dtype: object

In [31]:
print(df[['country','grade']])

  country grade
0     kor     A
1     usa     B
2   china     C
3   japan     D

In [32]:
df.loc[0]

country    kor
rank         1
grade        A
Name: 0, dtype: object

In [33]:
df.loc[0:2]

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C

In [34]:
df.loc[[0,2]]

  country  rank grade
0     kor     1     A
2   china     3     C

In [35]:
df.loc[0,'grade']

'A'

In [41]:
df['grade'][0]

'A'

In [42]:
df.loc[0:2, ['country','grade']]

  country grade
0     kor     A
1     usa     B
2   china     C

In [54]:
df.loc[(df['grade']=='A') | (df['rank']>2)]

  country  rank grade
0     kor     1     A
2   china     3     C
3   japan     4     D

In [57]:
df[df['country'] == 'kor']

  country  rank grade
0     kor     1     A

In [92]:
df.iloc[[0,3],[1,2]]

   rank grade
0     1     A
3     4     D

In [76]:
df[(df['country'] == 'kor') | (df['country'] == 'japan')]

  country  rank grade
0     kor     1     A
3   japan     4     D

In [94]:
df.filter?

In [95]:
df.filter(items=['country', 'rank'])

  country  rank
0     kor     1
1     usa     2
2   china     3
3   japan     4

In [98]:
df.filter(like='c', axis=1)

  country
0     kor
1     usa
2   china
3   japan

In [100]:
president = pd.Series(['Yoon', 'Biden', 'Kishida', 'Jinping'], index=[0,1,2,3])
president

0       Yoon
1      Biden
2    Kishida
3    Jinping
dtype: object

In [101]:
df['president'] = president

In [102]:
df

  country  rank grade president
0     kor     1     A      Yoon
1     usa     2     B     Biden
2   china     3     C   Kishida
3   japan     4     D   Jinping

In [103]:
import numpy as np
add = np.zeros(4).astype(int)
df['etc'] = add
df

  country  rank grade president  etc
0     kor     1     A      Yoon    0
1     usa     2     B     Biden    0
2   china     3     C   Kishida    0
3   japan     4     D   Jinping    0

In [104]:
df['new_grade'] = df['rank'] <3
df

  country  rank grade president  etc  new_grade
0     kor     1     A      Yoon    0       True
1     usa     2     B     Biden    0       True
2   china     3     C   Kishida    0      False
3   japan     4     D   Jinping    0      False

In [108]:
df.loc[4] = ['singapore', 4, 'D', 'Jao', 0, False]
df

     country  rank grade president  etc  new_grade
0        kor     1     A      Yoon    0       True
1        usa     2     B     Biden    0       True
2      china     3     C   Kishida    0      False
3      japan     4     D   Jinping    0      False
4  singapore     4     D       Jao    0      False

In [110]:
df = df.reset_index()

In [112]:
df.drop(index=4, inplace=True)

In [113]:
df

   index country  rank grade president  etc  new_grade
0      0     kor     1     A      Yoon    0       True
1      1     usa     2     B     Biden    0       True
2      2   china     3     C   Kishida    0      False
3      3   japan     4     D   Jinping    0      False

In [116]:
df.drop('new_grade', axis=1, inplace=True)

In [119]:
del df['etc']

In [120]:
df

   index country  rank grade president
0      0     kor     1     A      Yoon
1      1     usa     2     B     Biden
2      2   china     3     C   Kishida
3      3   japan     4     D   Jinping

In [175]:
data = {
    '영화' : ['명량', '극한직업', '신과함께-죄와 벌', '국제시장', '괴물', '도둑들', '7번방의 선물', '암살'],
    '개봉 연도' : [2014, 2019, 2017, 2014, 2006, 2012, 2013, 2015],
    '관객 수' : [1761, 1626, 1441, 1426, 1301, 1298, 1281, 1270],
    '평점' : [8.88, 9.20, 8.73, 9.16, 8.62, 7.64, 8.83, 9.10]
}

df = pd.DataFrame(data)
df

          영화  개봉 연도  관객 수    평점
0         명량   2014  1761  8.88
1       극한직업   2019  1626  9.20
2  신과함께-죄와 벌   2017  1441  8.73
3       국제시장   2014  1426  9.16
4         괴물   2006  1301  8.62
5        도둑들   2012  1298  7.64
6    7번방의 선물   2013  1281  8.83
7         암살   2015  1270  9.10

In [176]:
df['영화']

0           명량
1         극한직업
2    신과함께-죄와 벌
3         국제시장
4           괴물
5          도둑들
6      7번방의 선물
7           암살
Name: 영화, dtype: object

In [177]:
df[['영화', '평점']]

          영화    평점
0         명량  8.88
1       극한직업  9.20
2  신과함께-죄와 벌  8.73
3       국제시장  9.16
4         괴물  8.62
5        도둑들  7.64
6    7번방의 선물  8.83
7         암살  9.10

In [178]:
df[['영화', '개봉 연도']][df['개봉 연도'] > 2015]

          영화  개봉 연도
1       극한직업   2019
2  신과함께-죄와 벌   2017

In [179]:
#score 
df['관객 수'] * df['평점']/100

0    156.3768
1    149.5920
2    125.7993
3    130.6216
4    112.1462
5     99.1672
6    113.1123
7    115.5700
dtype: float64

In [180]:
df['추천점수'] = df['관객 수'] * df['평점']/100

In [181]:
df

          영화  개봉 연도  관객 수    평점      추천점수
0         명량   2014  1761  8.88  156.3768
1       극한직업   2019  1626  9.20  149.5920
2  신과함께-죄와 벌   2017  1441  8.73  125.7993
3       국제시장   2014  1426  9.16  130.6216
4         괴물   2006  1301  8.62  112.1462
5        도둑들   2012  1298  7.64   99.1672
6    7번방의 선물   2013  1281  8.83  113.1123
7         암살   2015  1270  9.10  115.5700

In [184]:
df = df.sort_values(by='개봉 연도', ascending=False)
df

          영화  개봉 연도  관객 수    평점      추천점수
1       극한직업   2019  1626  9.20  149.5920
2  신과함께-죄와 벌   2017  1441  8.73  125.7993
7         암살   2015  1270  9.10  115.5700
0         명량   2014  1761  8.88  156.3768
3       국제시장   2014  1426  9.16  130.6216
6    7번방의 선물   2013  1281  8.83  113.1123
5        도둑들   2012  1298  7.64   99.1672
4         괴물   2006  1301  8.62  112.1462